ideasapp/app/views/ideas/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 5]]
---
<h2 class = "comtitle">Comments</h2>
<% @idea.comments.each do |comment| %>