ideasapp/app/views/ideas/show.html.erb

<h2>Comments</h2>
<% @idea.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 4]]