app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello World"], ["text", "The world says hello!"], ["created_at", "2019-10-29 12:42:26.195231"], ["updated_at", "2019-10-29 12:42:26.195231"]]
---
    def create
        #here we will load parameters to a db

        #simply prints text
        #render plain: params[:article].inspect

        #accepts parameters but raises forbidden attr error
        #@article = Article.new(params[:article])

        #proper control params
        #@article = Article.new(params.require(:article).permit(:title, :text))

        #better abstraction than above, uses private method
        @article = Article.new(article_params)



        #returns boolean indicating true if saved
        #@article.save
        #redirect_to @article  #issues a new browser request

        #better than above, check if something is saved and redirect to it
        if @article.save