ideasapp/app/controllers/comments_controller.rb

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "idea_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", ""], ["body", ""], ["idea_id", 11], ["created_at", "2019-11-20 03:11:50.492348"], ["updated_at", "2019-11-20 03:11:50.492348"]]
---
    def create
        @idea = Idea.find(params[:idea_id])
        @comment = @idea.comments.create(comment_params)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."idea_id" = ? AND "comments"."id" = ? LIMIT ?  [["idea_id", 5], ["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
    def destroy
        @idea = Idea.find(params[:idea_id])
        @comment = @idea.comments.find(params[:id])
        @comment.destroy