ideasapp/app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas"
---
    def index
        @idea = Idea.all

INSERT INTO "ideas" ("text", "title", "labelled", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "asdfasdfasdfasdf"], ["title", "asdfasdfasdfasdf"], ["labelled", "Music"], ["created_at", "2019-11-20 03:03:43.798633"], ["updated_at", "2019-11-20 03:03:43.798633"]]
---
    def create
        #:idea is a form filled out by the user

        @idea = Idea.new(ideas_params)

        if @idea.save #saves the filled out form to the db

SELECT "ideas"."id" FROM "ideas" WHERE "ideas"."labelled" = ?  [["labelled", "Music"]]
SELECT "ideas"."id" FROM "ideas" WHERE "ideas"."labelled" = ?  [["labelled", "Art"]]
---
    def music
        if @idea = Idea.where(labelled: 'Music')
            render 'index'
        else
            @idea = Idea.all

SELECT "ideas"."id" FROM "ideas" WHERE "ideas"."labelled" = ?  [["labelled", "Art"]]
SELECT "ideas"."id" FROM "ideas" WHERE "ideas"."labelled" = ?  [["labelled", "Movies"]]
---
    def art
        if @idea = Idea.where(labelled: 'Art')
            render 'index'
        else
            @idea = Idea.all

SELECT "ideas"."id" FROM "ideas" WHERE "ideas"."labelled" = ?  [["labelled", "Theatre"]]
---
    def movies
        if @idea = Idea.where(labelled: 'Movies')

SELECT "ideas"."id" FROM "ideas" WHERE "ideas"."labelled" = ?  [["labelled", "Theatre"]]
---
    def theatre
        if @idea = Idea.where(labelled: 'Theatre')

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        @idea = Idea.find(params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @idea = Idea.find(params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def uprank

        if @idea = Idea.find(params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "ideas" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "ideas"."id" = ?
---
    def update

        @idea = Idea.find(params[:id])

        if @idea.update(ideas_params)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 3]]
---
    def destroy
        @idea = Idea.find(params[:id])
        @idea.destroy