ideasapp/app/controllers/ideas_controller.rb

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @idea = Idea.find(params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @idea = Idea.find(params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "ideas" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["title", "this is article 1 "], ["text", "i love this article"], ["updated_at", "2019-11-19 04:16:28.709949"], ["id", 6]]
---
    def updated

        @idea = Idea.find(params[:id])

        if @idea.update(ideas_params)